###############################################################################
# Created by write_sdc
###############################################################################
current_design skag_weight_w1_shiftadd
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {arrival_rate_q88[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {avg_fidelity_q016[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_q016[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {start}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {done}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[0]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[10]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[11]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[12]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[13]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[14]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[15]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[16]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[17]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[18]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[19]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[1]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[20]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[21]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[22]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[23]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[24]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[25]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[26]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[27]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[28]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[29]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[2]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[30]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[31]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[3]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[4]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[5]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[6]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[7]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[8]}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_q16[9]}]
set_false_path\
    -from [get_ports {rst_n}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
