###############################################################################
# Created by write_sdc
###############################################################################
current_design pareto_cmp_c0_full
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_a[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fidelity_b[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_a[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {hop_count_b[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_a[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {key_count_b[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_a[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {qber_b[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[16]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[17]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[18]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[19]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[20]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[21]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[22]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[23]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[24]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[25]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[26]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[27]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[28]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[29]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[30]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[31]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_a[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[0]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[10]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[11]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[12]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[13]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[14]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[15]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[16]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[17]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[18]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[19]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[1]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[20]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[21]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[22]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[23]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[24]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[25]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[26]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[27]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[28]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[29]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[2]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[30]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[31]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[3]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[4]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[5]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[6]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[7]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[8]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {score_b[9]}]
set_input_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {start}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {a_dominates_b}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {b_dominates_a}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {done}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {select_a}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {select_b}]
set_output_delay 1.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {tie}]
set_false_path\
    -from [get_ports {rst_n}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
